app/workers/user_worker.rb

  def perform(user_id)
    user =  User.find_by id: user_id
    user.update is_sent_mail: 1
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `is_sent_mail` = 1, `updated_at` = '2020-05-05 10:54:24' WHERE `users`.`id` = 1