app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `is_sent_mail`, `created_at`, `updated_at`) VALUES ('fdsfds', 1, '2020-05-04 03:02:33', '2020-05-04 03:02:33')
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE `users` SET `name` = 'abc', `updated_at` = '2020-05-05 10:53:52' WHERE `users`.`id` = 1
---
  def update
    respond_to do |format|
      if @user.update(user_params)